RT32024TEST.ОбменМагистральБП/src/Catalogs/МС_НоменклатураБП/МС_НоменклатураБП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МС_НоменклатураБП</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>СсылкаВДругойИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

RT32024TEST.ОбменМагистральБП/src/HTTPServices/МС_Обмен/Module.bsl
#Область ОбработчикиСобытий

Функция НоменклатураЗагрузитьНоменклатуру(Запрос)
	
	Попытка
		
		Если Запрос.HTTPМетод <> "POST" Тогда
			Возврат ОтветJSON(405, Новый Структура("success,error", Ложь, "Разрешен только POST"));
		КонецЕсли;
		
		ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
		
		Если ПустаяСтрока(ТелоЗапроса) Тогда
			Возврат ОтветJSON(400, Новый Структура("success,error", Ложь, "Пустое тело запроса"));
		КонецЕсли;
		
		Попытка
			ДанныеJSON = ПрочитатьJSONИзСтроки(ТелоЗапроса);
		Исключение
			Возврат ОтветJSON(400, Новый Структура("success,error", Ложь, "Некорректный JSON: " + ОписаниеОшибки()));
		КонецПопытки;
		
		МассивНоменклатуры = ПолучитьМассивНоменклатурыИзJSON(ДанныеJSON);
		
		СообщениеОбОшибке = "";
		Если Не ПроверитьJSONНоменклатуры(МассивНоменклатуры, СообщениеОбОшибке) Тогда
			Возврат ОтветJSON(400, Новый Структура("success,error", Ложь, СообщениеОбОшибке));
		КонецЕсли;
		
		РезультатЗагрузки = ЗагрузитьНоменклатуруВМС_НоменклатураБП(МассивНоменклатуры);
		
		Ответ = Новый Структура;
		Ответ.Вставить("success", РезультатЗагрузки.Успех);
		Ответ.Вставить("message", РезультатЗагрузки.Сообщение);
		Ответ.Вставить("stats", РезультатЗагрузки.Статистика);
		Ответ.Вставить("errors", РезультатЗагрузки.Ошибки);
		
		Если РезультатЗагрузки.Успех Тогда
			Возврат ОтветJSON(200, Ответ);
		Иначе
			Возврат ОтветJSON(500, Ответ);
		КонецЕсли;
		
	Исключение
		
		Возврат ОтветJSON(500, Новый Структура("success,error", Ложь, ОписаниеОшибки()));
		
	КонецПопытки;
	
КонецФункции

#КонецОбласти


#Область ЗагрузкаНоменклатуры

Функция ЗагрузитьНоменклатуруВМС_НоменклатураБП(МассивНоменклатуры)
	
	Статистика = Новый Структура;
	Статистика.Вставить("Всего", 0);
	Статистика.Вставить("СозданоГрупп", 0);
	Статистика.Вставить("ОбновленоГрупп", 0);
	Статистика.Вставить("СозданоЭлементов", 0);
	Статистика.Вставить("ОбновленоЭлементов", 0);
	Статистика.Вставить("Пропущено", 0);
	Статистика.Вставить("Ошибок", 0);
	
	Ошибки = Новый Массив;
	ПустойРодитель = Справочники.МС_НоменклатураБП.ПустаяСсылка();
	
	Попытка
		
		ЗагрузитьМассивУзловНоменклатуры(
			МассивНоменклатуры,
			ПустойРодитель,
			Статистика,
			Ошибки
		);
		
		Успех = Статистика.Ошибок = 0;
		
		Сообщение = СтрШаблон(
			"Загрузка завершена. Всего: %1. Группы: создано %2, обновлено %3. Элементы: создано %4, обновлено %5. Пропущено: %6. Ошибок: %7.",
			Статистика.Всего,
			Статистика.СозданоГрупп,
			Статистика.ОбновленоГрупп,
			Статистика.СозданоЭлементов,
			Статистика.ОбновленоЭлементов,
			Статистика.Пропущено,
			Статистика.Ошибок
		);
		
		Возврат Новый Структура("Успех,Сообщение,Статистика,Ошибки", Успех, Сообщение, Статистика, Ошибки);
		
	Исключение
		
		Сообщение = "Критическая ошибка при загрузке номенклатуры: " + ОписаниеОшибки();
		ДобавитьОшибку(Ошибки, Статистика, Сообщение);
		
		Возврат Новый Структура("Успех,Сообщение,Статистика,Ошибки", Ложь, Сообщение, Статистика, Ошибки);
		
	КонецПопытки;
	
КонецФункции


Процедура ЗагрузитьМассивУзловНоменклатуры(МассивУзлов, РодительСсылка, Статистика, Ошибки)
	
	Для Каждого УзелJSON Из МассивУзлов Цикл
		
		СсылкаУзла = ЗагрузитьОдинУзелНоменклатуры(
			УзелJSON,
			РодительСсылка,
			Статистика,
			Ошибки
		);
		
		Дети = ЗначениеСвойства(УзелJSON, "Дети", Неопределено);
		
		Если Дети <> Неопределено 
			И Дети <> Null 
			И ТипЗнч(Дети) = Тип("Массив") 
			И Дети.Количество() > 0 Тогда
			
			Если Не ЭтоГруппаJSON(УзелJSON) Тогда
				ДобавитьОшибку(
					Ошибки,
					Статистика,
					"У элемента есть дочерние элементы, но ЭтоГруппа = Ложь. GUID: " 
						+ СтрокаИзJSON(ЗначениеСвойства(УзелJSON, "Гуид", ""))
				);
				Продолжить;
			КонецЕсли;
			
			Если СсылкаУзла = Справочники.МС_НоменклатураБП.ПустаяСсылка() Тогда
				ДобавитьОшибку(
					Ошибки,
					Статистика,
					"Дочерние элементы пропущены, так как не удалось создать родителя. GUID родителя: "
						+ СтрокаИзJSON(ЗначениеСвойства(УзелJSON, "Гуид", ""))
				);
				Продолжить;
			КонецЕсли;
			
			ЗагрузитьМассивУзловНоменклатуры(
				Дети,
				СсылкаУзла,
				Статистика,
				Ошибки
			);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


Функция ЗагрузитьОдинУзелНоменклатуры(УзелJSON, РодительСсылка, Статистика, Ошибки)
	
	ПустаяСсылка = Справочники.МС_НоменклатураБП.ПустаяСсылка();
	
	Если ТипЗнч(УзелJSON) <> Тип("Структура") Тогда
		Статистика.Пропущено = Статистика.Пропущено + 1;
		ДобавитьОшибку(Ошибки, Статистика, "Узел JSON не является объектом.");
		Возврат ПустаяСсылка;
	КонецЕсли;
	
	GUIDСтрока = СтрокаИзJSON(ЗначениеСвойства(УзелJSON, "Гуид", ""));
	
	Если ПустаяСтрока(GUIDСтрока) Тогда
		Статистика.Пропущено = Статистика.Пропущено + 1;
		ДобавитьОшибку(Ошибки, Статистика, "У узла не заполнено поле Гуид.");
		Возврат ПустаяСсылка;
	КонецЕсли;
	
//	Попытка
//		Новый УникальныйИдентификатор(GUIDСтрока);
//	Исключение
//		Статистика.Пропущено = Статистика.Пропущено + 1;
//		ДобавитьОшибку(Ошибки, Статистика, "Некорректный GUID: " + GUIDСтрока);
//		Возврат ПустаяСсылка;
//	КонецПопытки;
	
	Наименование = ПодготовитьНаименование(ЗначениеСвойства(УзелJSON, "Наименование", ""));
	НаименованиеПолное = СтрокаИзJSON(ЗначениеСвойства(УзелJSON, "НаименованиеПолное", ""));
	ЭтоГруппа = ЭтоГруппаJSON(УзелJSON);
	
	Если ПустаяСтрока(НаименованиеПолное) Тогда
		НаименованиеПолное = Наименование;
	КонецЕсли;
	
	Попытка
		
		Создан = Ложь;
		
		ОбъектНоменклатуры = ПолучитьИлиСоздатьОбъектМС_НоменклатураБП(
			GUIDСтрока,
			ЭтоГруппа,
			Создан
		);
		
		ОбъектНоменклатуры.ОбменДанными.Загрузка = Истина;
		
		ОбъектНоменклатуры.Наименование = Наименование;
		Если Не ЭтоГруппа Тогда
			ОбъектНоменклатуры.НаименованиеПолное = НаименованиеПолное;
		КонецЕсли;
		ОбъектНоменклатуры.Родитель = РодительСсылка;
		
		ОбъектНоменклатуры.Записать();
		
		Статистика.Всего = Статистика.Всего + 1;
		
		Если ЭтоГруппа Тогда
			Если Создан Тогда
				Статистика.СозданоГрупп = Статистика.СозданоГрупп + 1;
			Иначе
				Статистика.ОбновленоГрупп = Статистика.ОбновленоГрупп + 1;
			КонецЕсли;
		Иначе
			Если Создан Тогда
				Статистика.СозданоЭлементов = Статистика.СозданоЭлементов + 1;
			Иначе
				Статистика.ОбновленоЭлементов = Статистика.ОбновленоЭлементов + 1;
			КонецЕсли;
		КонецЕсли;
		
		Возврат ОбъектНоменклатуры.Ссылка;
		
	Исключение
		
		Статистика.Пропущено = Статистика.Пропущено + 1;
		
		ТекстОшибки = "Ошибка загрузки узла. GUID: " + GUIDСтрока 
			+ ". Наименование: " + Наименование
			+ ". Ошибка: " + ОписаниеОшибки();
		
		ДобавитьОшибку(Ошибки, Статистика, ТекстОшибки);
		
		ЗаписьЖурналаРегистрации(
			"МС_Обмен.ЗагрузкаНоменклатуры",
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			ТекстОшибки
		);
		
		Возврат ПустаяСсылка;
		
	КонецПопытки;
	
КонецФункции


Функция ПолучитьИлиСоздатьОбъектМС_НоменклатураБП(GUIDСтрока, ЭтоГруппа, Создан)
	
	Создан = Ложь;
	
	СсылкаПоРеквизиту = Справочники.МС_НоменклатураБП.НайтиПоРеквизиту("СсылкаВДругойИБ", GUIDСтрока); 
	
	Если СсылкаПоРеквизиту <> Справочники.МС_НоменклатураБП.ПустаяСсылка() Тогда
		
		ОбъектНоменклатуры = СсылкаПоРеквизиту.ПолучитьОбъект();
		
		Если ОбъектНоменклатуры <> Неопределено Тогда
			
			Если ОбъектНоменклатуры.ЭтоГруппа <> ЭтоГруппа Тогда
				ВызватьИсключение "Найден объект по СсылкаВДругойИБ, но другой тип элемента/группы: " + GUIDСтрока;
			КонецЕсли;
			
			Возврат ОбъектНоменклатуры;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		ОбъектНоменклатуры = Справочники.МС_НоменклатураБП.СоздатьГруппу();
	Иначе
		ОбъектНоменклатуры = Справочники.МС_НоменклатураБП.СоздатьЭлемент();
	КонецЕсли;
	
	ОбъектНоменклатуры.СсылкаВДругойИБ = GUIDСтрока;
	
	Создан = Истина;
	
	Возврат ОбъектНоменклатуры;
	
КонецФункции

#КонецОбласти


#Область ПроверкаJSON

Функция ПолучитьМассивНоменклатурыИзJSON(ДанныеJSON)
	
	Если ТипЗнч(ДанныеJSON) = Тип("Массив") Тогда
		Возврат ДанныеJSON;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеJSON) = Тип("Структура") Тогда
		Возврат ЗначениеСвойства(ДанныеJSON, "items", Неопределено);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПроверитьJSONНоменклатуры(МассивНоменклатуры, СообщениеОбОшибке)
	
	СообщениеОбОшибке = "";
	
	Если МассивНоменклатуры = Неопределено Или МассивНоменклатуры = Null Тогда
		СообщениеОбОшибке = "Не найдены данные номенклатуры. Ожидается массив JSON или объект с полем items.";
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипЗнч(МассивНоменклатуры) <> Тип("Массив") Тогда
		СообщениеОбОшибке = "Ожидается массив номенклатуры.";
		Возврат Ложь;
	КонецЕсли;
	
	Если МассивНоменклатуры.Количество() = 0 Тогда
		СообщениеОбОшибке = "Массив номенклатуры пустой.";
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ПрочитатьJSONИзСтроки(СтрокаJSON)
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	
	Данные = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Возврат Данные;
	
КонецФункции


Функция ОтветJSON(КодСостояния, Данные)
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	ЗаписатьJSON(ЗаписьJSON, Данные);
	
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Ответ = Новый HTTPСервисОтвет(КодСостояния);
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8);
	
	Возврат Ответ;
	
КонецФункции


Функция ЗначениеСвойства(Данные, ИмяСвойства, ЗначениеПоУмолчанию = Неопределено)
	
	Если Данные = Неопределено Или Данные = Null Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Если ТипЗнч(Данные) <> Тип("Структура") Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Если Данные.Свойство(ИмяСвойства) Тогда
		Возврат Данные[ИмяСвойства];
	КонецЕсли;
	
	Возврат ЗначениеПоУмолчанию;
	
КонецФункции


Функция СтрокаИзJSON(Значение, ЗначениеПоУмолчанию = "")
	
	Если Значение = Неопределено Или Значение = Null Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат СокрЛП(Строка(Значение));
	
КонецФункции


Функция БулевоИзJSON(Значение, ЗначениеПоУмолчанию = Ложь)
	
	Если Значение = Неопределено Или Значение = Null Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("Булево") Тогда
		Возврат Значение;
	КонецЕсли;
	
	СтрокаЗначения = НРег(СокрЛП(Строка(Значение)));
	
	Если СтрокаЗначения = "true" Или СтрокаЗначения = "истина" Или СтрокаЗначения = "1" Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если СтрокаЗначения = "false" Или СтрокаЗначения = "ложь" Или СтрокаЗначения = "0" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ЗначениеПоУмолчанию;
	
КонецФункции


Функция ЭтоГруппаJSON(УзелJSON)
	Возврат БулевоИзJSON(ЗначениеСвойства(УзелJSON, "ЭтоГруппа", Ложь), Ложь);
КонецФункции


Функция ПодготовитьНаименование(ЗначениеНаименования)
	
	Наименование = СтрокаИзJSON(ЗначениеНаименования, "");
	
	Если ПустаяСтрока(Наименование) Тогда
		Наименование = "Без названия";
	КонецЕсли;
	
	ДлинаНаименования = Метаданные.Справочники.МС_НоменклатураБП.ДлинаНаименования;
	
	Если ДлинаНаименования > 0 И СтрДлина(Наименование) > ДлинаНаименования Тогда
		Наименование = Лев(Наименование, ДлинаНаименования);
	КонецЕсли;
	
	Возврат Наименование;
	
КонецФункции


Функция РеквизитМС_НоменклатураБПСуществует(ИмяРеквизита)
	Возврат Метаданные.Справочники.МС_НоменклатураБП.Реквизиты.Найти(ИмяРеквизита) <> Неопределено;
КонецФункции


Процедура ДобавитьОшибку(Ошибки, Статистика, ТекстОшибки)
	
	Статистика.Ошибок = Статистика.Ошибок + 1;
	
	Если Ошибки.Количество() < 100 Тогда
		Ошибки.Добавить(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
